## jvm分区
- 方法区
- Java堆
- java虚拟机栈
- 本地方法栈
- 程序计数器
- OutOfMemoryError

## 内存分配
### 内存分配策略
- 对象优先分配在eden区
- 大对象(大字符串,大数组)直接分配在老年代
- 长期存活的对象进入老年代
- 动态对象年龄判定
- 空间分配担保

### full gc的条件
- system.gc
- 老年代空间不足
- 空间分配担保失败
- conccurent mode failure

## java垃圾回收
### 对象已死？
- 引用计数法
- 可达性分析


### 垃圾回收算法
- 标记清除
- 标记复制
- 标记整理
- 分代收集
- 疑问
    - 新生代用标记整理？老年代用标记复制？
    - 复制和整理的效率对比？
    - 复制为什么要两个s区？
    - 三种算法效率对比？
### 垃圾收集器
- serial
- parnew
- parallel
- serial old
- parallel old
- CMS 
    - 缺点
        - 浮动垃圾
        - mode failure
        - 内碎片
    - 收集过程
    - full gc ！= cms gc
- G1

## 类文件结构
### class文件结构
- 魔数
- 常量池
- 访问标志
- 字段表
- 方法表
- 属性表

## 类加载机制
### 加载过程
- 装载
- 验证
- 准备
- 解析
- 初始化

### 加载器
- 类与类加载器
- 双亲委托模型

## 编译优化
### 编译过程

### java语法糖
- 泛型与类型擦除
- 自动装箱,拆箱
- 条件编译